#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
#является ли этот день выходным.
#Пример:
#- 6 -> да
#- 7 -> да
#- 1 -> нет



#D = int(input('Введите день недели: '))
#if D == 5:
 #   print('Выходной')
#elif D == 6:
    #print('Выходной')
#else:
  #  print('будний')
    
    
    
#Напишите программу для проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

#a = 0
#b = 1
#for x in range (a, b):
 #   for y in range (a, b):
  #      for z in range (a, b):
   #         print ((not x or not y or not z) == (not x and not y and not z))


